/*
* *********************************************************
* Copyright (c) 2017 智动天地(北京)科技有限公司
* All rights reserved.
* Project: 标准平台决策开发系统
* Authors:
* 智动天地(北京)科技有限公司
* *********************************************************
*/

package edu.tigers.sumatra.ai.data;

import com.sleepycat.persist.model.Persistent;



@Persistent
public class Percentage
{
	// --------------------------------------------------------------------------
	// --- variables and constants ----------------------------------------------
	// --------------------------------------------------------------------------
	
	private int		current	= 0;
	private int		all		= 1;
	private double	percent	= 0.0;
	
	
	// --------------------------------------------------------------------------
	// --- constructors ---------------------------------------------------------
	// --------------------------------------------------------------------------
	
	
	// --------------------------------------------------------------------------
	// --- methods --------------------------------------------------------------
	// --------------------------------------------------------------------------
	
	// --------------------------------------------------------------------------
	// --- getter/setter --------------------------------------------------------
	// --------------------------------------------------------------------------
	
	public int getCurrent()
	{
		return current;
	}
	
	
	
	public void inc()
	{
		current = current + 1;
		percent = (double) current / all;
	}
	
	
	
	public void setAll(final int all)
	{
		this.all = all;
		percent = (double) current / all;
	}
	
	
	
	public double getPercent()
	{
		return percent;
	}
}
